coll.json

{"item":[{"id":"c5f0f5aa-3b59-4a59-8666-77984377551b","name":"Add","description":{"content":"Adds two integers. This is a test WebService. ©DNE Online","type":"text/plain"},"request":{"url":{"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Add xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Add>\n  </soap:Body>\n</soap:Envelope>\n","options":{"raw":{"language":"xml"}}}},"response":[{"id":"7977c530-18d9-45d9-9f84-db7d879d186d","name":"Add response","originalRequest":{"url":{"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Add xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Add>\n  </soap:Body>\n</soap:Envelope>\n","options":{"raw":{"language":"xml"}}}},"status":"OK","code":200,"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <AddResponse xmlns=\"http://tempuri.org/\">\n      <AddResult>-2147483648</AddResult>\n    </AddResponse>\n  </soap:Body>\n</soap:Envelope>\n","cookie":[],"_postman_previewlanguage":"xml"}],"event":[]},{"id":"be628304-05b4-470b-b26c-0348a8334377","name":"Subtract","description":{"content":"","type":"text/plain"},"request":{"url":{"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Subtract xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Subtract>\n  </soap:Body>\n</soap:Envelope>\n","options":{"raw":{"language":"xml"}}}},"response":[{"id":"0a433d50-3837-4f9b-aa7f-e35f977ed214","name":"Subtract response","originalRequest":{"url":{"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Subtract xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Subtract>\n  </soap:Body>\n</soap:Envelope>\n","options":{"raw":{"language":"xml"}}}},"status":"OK","code":200,"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <SubtractResponse xmlns=\"http://tempuri.org/\">\n      <SubtractResult>-2147483648</SubtractResult>\n    </SubtractResponse>\n  </soap:Body>\n</soap:Envelope>\n","cookie":[],"_postman_previewlanguage":"xml"}],"event":[]},{"id":"dbf8d4cd-7109-49bb-8645-9af863f42916","name":"Multiply","description":{"content":"","type":"text/plain"},"request":{"url":{"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Multiply xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Multiply>\n  </soap:Body>\n</soap:Envelope>\n","options":{"raw":{"language":"xml"}}}},"response":[{"id":"a24d85ca-385c-42cc-bf50-b8e5e7f3896d","name":"Multiply response","originalRequest":{"url":{"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Multiply xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Multiply>\n  </soap:Body>\n</soap:Envelope>\n","options":{"raw":{"language":"xml"}}}},"status":"OK","code":200,"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <MultiplyResponse xmlns=\"http://tempuri.org/\">\n      <MultiplyResult>-2147483648</MultiplyResult>\n    </MultiplyResponse>\n  </soap:Body>\n</soap:Envelope>\n","cookie":[],"_postman_previewlanguage":"xml"}],"event":[]},{"id":"e638f0a2-54fc-4a72-a0ca-9ce0e1064442","name":"Divide","description":{"content":"","type":"text/plain"},"request":{"url":{"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Divide xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Divide>\n  </soap:Body>\n</soap:Envelope>\n","options":{"raw":{"language":"xml"}}}},"response":[{"id":"1eb0a941-e327-42e9-b26a-2af974cea992","name":"Divide response","originalRequest":{"url":{"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Divide xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Divide>\n  </soap:Body>\n</soap:Envelope>\n","options":{"raw":{"language":"xml"}}}},"status":"OK","code":200,"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <DivideResponse xmlns=\"http://tempuri.org/\">\n      <DivideResult>-2147483648</DivideResult>\n    </DivideResponse>\n  </soap:Body>\n</soap:Envelope>\n","cookie":[],"_postman_previewlanguage":"xml"}],"event":[]},{"id":"150a4e66-5b58-4f08-8afc-4f33ff593180","name":"Add","description":{"content":"Adds two integers. This is a test WebService. ©DNE Online","type":"text/plain"},"request":{"url":{"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Add xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Add>\n  </soap12:Body>\n</soap12:Envelope>\n","options":{"raw":{"language":"xml"}}}},"response":[{"id":"cb62bde8-b054-42f9-9fb7-a497224e408a","name":"Add response","originalRequest":{"url":{"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Add xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Add>\n  </soap12:Body>\n</soap12:Envelope>\n","options":{"raw":{"language":"xml"}}}},"status":"OK","code":200,"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <AddResponse xmlns=\"http://tempuri.org/\">\n      <AddResult>-2147483648</AddResult>\n    </AddResponse>\n  </soap12:Body>\n</soap12:Envelope>\n","cookie":[],"_postman_previewlanguage":"xml"}],"event":[]},{"id":"de6e5695-b7f0-4c83-a622-22d373b77321","name":"Subtract","description":{"content":"","type":"text/plain"},"request":{"url":{"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Subtract xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Subtract>\n  </soap12:Body>\n</soap12:Envelope>\n","options":{"raw":{"language":"xml"}}}},"response":[{"id":"fab7fddd-5a52-44c1-a22c-86a6c6ef6d54","name":"Subtract response","originalRequest":{"url":{"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Subtract xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Subtract>\n  </soap12:Body>\n</soap12:Envelope>\n","options":{"raw":{"language":"xml"}}}},"status":"OK","code":200,"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <SubtractResponse xmlns=\"http://tempuri.org/\">\n      <SubtractResult>-2147483648</SubtractResult>\n    </SubtractResponse>\n  </soap12:Body>\n</soap12:Envelope>\n","cookie":[],"_postman_previewlanguage":"xml"}],"event":[]},{"id":"3e23d77f-3616-40e5-a6f6-4fd4b613e2be","name":"Multiply","description":{"content":"","type":"text/plain"},"request":{"url":{"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Multiply xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Multiply>\n  </soap12:Body>\n</soap12:Envelope>\n","options":{"raw":{"language":"xml"}}}},"response":[{"id":"58d5b566-f96f-49ed-a20f-ea8b425e8a22","name":"Multiply response","originalRequest":{"url":{"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Multiply xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Multiply>\n  </soap12:Body>\n</soap12:Envelope>\n","options":{"raw":{"language":"xml"}}}},"status":"OK","code":200,"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <MultiplyResponse xmlns=\"http://tempuri.org/\">\n      <MultiplyResult>-2147483648</MultiplyResult>\n    </MultiplyResponse>\n  </soap12:Body>\n</soap12:Envelope>\n","cookie":[],"_postman_previewlanguage":"xml"}],"event":[]},{"id":"4d11ea5c-671e-4239-947a-141474b80a07","name":"Divide","description":{"content":"","type":"text/plain"},"request":{"url":{"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Divide xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Divide>\n  </soap12:Body>\n</soap12:Envelope>\n","options":{"raw":{"language":"xml"}}}},"response":[{"id":"736808dc-7579-4153-81c5-a7b98b1c21ac","name":"Divide response","originalRequest":{"url":{"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Divide xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Divide>\n  </soap12:Body>\n</soap12:Envelope>\n","options":{"raw":{"language":"xml"}}}},"status":"OK","code":200,"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <DivideResponse xmlns=\"http://tempuri.org/\">\n      <DivideResult>-2147483648</DivideResult>\n    </DivideResponse>\n  </soap12:Body>\n</soap12:Envelope>\n","cookie":[],"_postman_previewlanguage":"xml"}],"event":[]}],"event":[],"variable":[],"info":{"_postman_id":"ad67bc6b-d1bf-4a73-820b-0a0b7693f75a","name":"http://tempuri.org/","schema":"https://schema.getpostman.com/json/collection/v2.1.0/collection.json","description":{"content":"\n[object Object]CalculatorSoap\n[object Object]CalculatorSoap\n[object Object]CalculatorSoap\n[object Object]CalculatorSoap\n[object Object]CalculatorSoap12\n[object Object]CalculatorSoap12\n[object Object]CalculatorSoap12\n[object Object]CalculatorSoap12","type":"text/plain"}}}